#ifndef NAMEDAYS_GR_H
#define NAMEDAYS_GR_H
// clang-format off

/* -- Ελληνικό Εορτολόγιο Ονομάτων -- Ονόματα αγίων της Ορθόδοξης Εκκλησίας για κάθε ημέρα του έτους 
https://www.eortologio.net/month/12/%CE%94%CE%B5%CE%BA%CE%AD%CE%BC%CE%B2%CF%81%CE%B9%CE%BF%CF%82 
www.saint.gr/2025/02/calendar.aspx*/

const char* nameday_label = "Γιορτάζει Ο/Η:"; // Ονομαστική γιορτή

const char* namedays[] = {
  // Ιανουάριος
  "Βασίλης, Βασιλική", // 1 Πρωτοχρονιά, Άγιος Βασίλειος
  "        ", // 2
  "        ", // 3
  "        ", // 4
  "        ", // 5
  "Φώτης, Φωτεινή, Ιορδάνης, Θεοφάνης, Θεοφανία, Φάνης, Φανή", // 6 Θεοφάνεια
  "Ιωάννης, Ιωάννα", // 7 Σύναξις Ιωάννου Βαπτιστού
  "        ", // 8
  "        ", // 9
  "        ", // 10
  "        ", // 11
  "        ", // 12
  "        ", // 13
  "        ", // 14
  "        ", // 15
  "        ", // 16
  "Αντώνιος, Αντωνία", // 17 Άγιος Αντώνιος
  "Αθανάσιος, Αθανασία", // 18 Άγιος Αθανάσιος
  "        ", // 19
  "Ευθύμιος, Ευθυμία", // 20  Άγιος Ευθύμιος
  "        ", // 21
  "        ", // 22
  "        ", // 23
  "        ", // 24
  "Γρηγόριος,Γρηγορία", // 25 Άγιος Γρηγόριος ο Θεολόγος
  "        ", // 26
  "Ιωάννης", // 27 Άγιος Ιωάννης Χρυσόστομος
  "Εφραίμ", // 28 Άγιος Εφραίμ
  "        ", // 29
  "Βασίλειος, Γρηγόριος, Ιωάννης", // 30 Των Τριών Ιεραρχών
  "        ", // 31

  // Φεβρουάριος
  "Τρύφωνας", // 1 Αγίου Τρύφωνος
  "Υπαπαντή", // 2 Υπαπαντή του Χριστού
  "        ", // 3
  "Ισίδωρος, Ισιδώρα", // 4
  "Αγαθή", // 5
  "Φώτιος, Φωτεινή", // 6 Αγίου Φωτίου του Μεγάλου
  "        ", // 7
  "Ζαχαρίας, Ζαχαρούλα", // 8
  "Νικηφόρος", // 9
  "Χαράλαμπος, Χαραλαμπία", // 10 Χαραλάμπους Ιερομάρτυρος
  "Βλάσιος", // 11  Αγίου Βλασίου   "	
  "Μελέτιος, Μελέτης, Μελετία", // 12
  "        ", // 13  Αγίων Ακύλα και Πρίσκιλλας των Αποστόλων
  "Βαλεντίνη, Βαλεντίνα", // 14
  "Ευσεβεία, Σέβη", // 15
  "        ", // 16
  "Θεόδωρος,Θοδωρής, Θεοδώρα, Δώρα", // 17
  "Φιλοθέη", // 18
  "        ", // 19
  "        ", // 20
  "        ", // 21
  "        ", // 22
  "        ", // 23
  "        ", // 24
  "Ρεγγίνα", // 25 Αγίου Ρηγίνου Ιερομάρτυρος, Αγίου Ταρασίου
  "        ", // 26
  "        ", // 27
  "        ", // 28
  "        ", // 29

  // Μάρτιος
  "Ευδοκία", // 1
  "Ευθαλία ", // 2
  "        ", // 3
  "        ", // 4
  "        ", // 5
  "        ", // 6
  "        ", // 7
  "        ", // 8
  "        ", // 9
  "        ", // 10
  "        ", // 11
  "        ", // 12
  "        ", // 13
  "Βενέδικτος,Ματθίλντη, Ματίλντα", // 14
  "        ", // 15
  "Χριστόδουλος", // 16
  "Αλέξιος", // 17
  "        ", // 18
  "Χρύσανθος,Χρυσάνθη, Δαρεία", // 19
  "        ", // 20
  "        ", // 21
  "        ", // 22
  "        ", // 23
  "        ", // 24
  "Ευάγγελος, Ευαγγελία", // 25 ΕΥΑΓΓΕΛΙΣΜΟΣ ΤΗΣ ΘΕΟΤΟΚΟΥ
  "        ", // 26
  "        ", // 27
  "        ", // 28
  "        ", // 29
  "Ιωάννης", // 30
  "Υπάτιος, Υπάτία", // 31

  // Απρίλιος
  "        ", // 1
  "Τίτος", // 2
  "Νικήτας", // 3
  "        ", // 4
  "        ", // 5
  "        ", // 6
  "        ", // 7
  "        ", // 8
  "        ", // 9
  "Μάξιμος,Δημοσθένης, Δήμος, Επαμεινώνδας, Νώντας, Τιμόθεος, Τίμος, Φιλοποίμην, Φωκίων", // 10
  "Αντύπας", // 11
  "       ", // 12
  "        ", // 13
  "Θωμαΐς, Θωμαΐδα", // 14
  "Λεωνίδας", // 15
  "        ", // 16
  "        ", // 17
  "        ", // 18
  "        ", // 19
  "        ", // 20
  "        ", // 21
  "Ραφαέλα, Ραφαηλία, Ραφαήλ", // 22
  "Γεώργιος, Γεωργία", // 23
  "        ", // 24
  "Μάρκος", // 25
  "        ", // 26
  "        ", // 27
  "        ", // 28
  "Ιάσων, Ιάσονας, Ιάσωνας", // 29
  "Ιάκωβος, Ιακωβίνα", // 30

  // Μάιος
  "Ιερεμίας", // 1  Εργατική Πρωτομαγιά
  "Αθανάσιος", // 2
  "        ", // 3
  "        ", // 4
  "Ειρηναίος", // 5
  "Ιώβ", // 6
  "        ", // 7
  "Αρσένιος", // 8
  "Ησαΐας", // 9
  "Σίμων", // 10
  "Κύριλλος, Μεθόδιος", // 11
  "Επιφάνιος", // 12
  "Γλυκερία", // 13
  "Ισίδωρος", // 14
  "Αχίλλειος", // 15
  "Θεοδόσιος", // 16
  "Ανδρόνικος", // 17
  "Πατρίκιος", // 18
  "        ", // 19
  "        ", // 20
  "Κωνσταντίνος, Κωνσταντίνα,Ελένη", // 21
  "Αιμιλία", // 22
  "        ", // 23
  "        ", // 24
  "Επιφάνιος", // 25
  "        ", // 26
  "        ", // 27
  "Αυγουστίνος", // 28
  "Υπομονή", // 29
  "Εμμέλεια", // 30
  "        ", // 31

  // Ιούνιος
  "Ιουστίνος", // 1
  "Νικηφόρος", // 2
  "Υπατία, Υπατή, Υπατούλα, Πατούλα", // 3
  "Μάρθα", // 4
  "Δωρόθεος, Πλούταρχος", // 5
  "Ιλαρίων", // 6
  "Σεβαστή, Σέβη", // 7
  "Καλλιόπη", // 8
  "Κυπριανός", // 9
  "        ", // 10
  "Βαρθολομαίος, Βαρνάβας", // 11
  "Ονούφριος", // 12
  "Τριφύλλιος", // 13
  "Ελισσαίος", // 14
  "Φραγκίσκος, Φρατζέσκα, Αμφιλόχιος", // 15 Των Αγίων Πάντων
  "Τίχων", // 16
  "        ", // 17
  "Έρασμος", // 18
  "Παΐσιος", // 19
  "        ", // 20
  "        ", // 21
  "        ", // 22
  "Αριστοκλής", // 23
  "Ιωάννης", // 24
  "        ", // 25
  "Δαβίδ", // 26
  "Σαμψών", // 27
  "Γερμανός", // 28
  "Πέτρος, Παύλος", // 29 Αποστόλων Πετρου και Παύλου
  "Απόστολος, Αποστολία", // 30

  // Ιούλιος
  "Κοσμάς, Δαμιανός, Ανάργυρος, Ανάργυρη", // 1
  "        ", // 2
  "Υάκινθος, Υακίνθη, Ζουμπουλία", // 3
  "         ", // 4
  "        ", // 5
  "        ", // 6
  "Κυριακή", // 7
  "Προκόπης, Προκοπία", // 8
  "Παγκράτιος", // 9
  "        ", // 10
  "Ευφημία", // 11
  "Παΐσιος, Βερονίκη", // 12
  "        ", // 13
  "Νικόδημος, Ακύλας", // 14
  "Βλαδίμηρος", // 15
  "        ", // 16
  "Μαρίνα, Μαρίνος", // 17
  "Αιμιλιανός, Αιμίλιος", // 18
  "        ", // 19
  "Ηλίας, Ηλιάνα", // 20
  "        ", // 21
  "Μαρία, Μαγδαληνή, Μαρκέλα", // 22
  "        ", // 23
  "        ", // 24
  "        ", // 25
  "Πάρις, Παρασκευάς, Παρασκευή", // 26
  "Παντελεήμων, Παντελής, Παντέλος", // 27
  "Χρυσοβαλάντω", // 28
  "        ", // 29
  "Ανδρόνικος, Ανδρονίκη", // 30
  "Ιωσήφ", // 31

  // Αύγουστος
  "        ", // 1
  "        ", // 2
  "        ", // 3
  "        ", // 4
  "        ", // 5
  "Σωτήριος, Σωτήρης, Σώτος, Σώτης, Σωτηρία, Σωτήρω, Σωτία, Ευμορφία, Μορφούλα", // 6
  "        ", // 7
  "Μύρων", // 8
  "        ", // 9
  "Λαυρέντιος, Λαυρέντης, Ηρώ, Ιππόλυτος, Ιππολύτη, Πόλυ", // 10
  "        ", // 11
  "        ", // 12
  "        ", // 13
  "        ", // 14
  "Παναγιώτης, Παναγιώτα, Μαρία", // 15
  "Σταμάτης, Σαράντης, Σαράντος", // 16
  "        ", // 17
  "Φλώρος, Λαύρος", // 18
  "           ", // 19
  "          ", // 20
  "Αγαθόνικος", // 21
  "        ", // 22
  "        ", // 23
  "Ευτύχιος", // 24
  "        ", // 25
  "Αδριανός, Αδριανή, Ανδριαννή, Ναταλία", // 26
  "Φανούριος", // 27
  "        ", // 28
  "         ", // 29
  "Αλέξανδρος, Αλεξάνδρα", // 30
  "        ", // 31

  // Σεπτέμβριος
  "Αθηνά, Ελπινίκη,Θάλεια, Καλλιρρόη, Χαρίκλεια, Χαρά, Χαρούλα", // 1 Αγίων Σαράντα Παρθένων και ασκητριών,
  "Μάμας", // 2
  "Ανθιμος", // 3
  "Ερμιόνη", // 4
  "Ζαχαρίας", // 5
  "        ", // 6
  "        ", // 7
  "Μαρία, Δέσποινα, Τσαμπίκος, Τσαμπίκα", // 8 Γέννηση της Θεοτόκου
  "Ιωακείμ, Άννα", // 9
  "Κλήμης", // 10
  "        ", // 11
  "        ", // 12
  "Κορνήλιος", // 13
  "Σταύρος, Σταυρούλα", // 14
  "Νικήτας, Βησσαρίων", // 15
  "Ευφημία", // 16
  "Σοφία, Πίστις, Αγάπη, Ελπίς", // 17
  "Αριάδνη", // 18
  "        ", // 19
  "Ευστάθιος, Ευσταθία", // 20
  "Ιωνάς", // 21
  "Ζωγραφιά, Φωκάς", // 22
  "Πολυξένη, Ξανθίππη, Ξανθή, Ίρις, Ίριδα", // 23
  "Μυρσίνη, Μυρτώ, Μυρτιά, Μυρτιδιώτισσα, Θέκλα", // 24
  "Ευφροσύνη, Φρόσω", // 25
  "Ιωάννης", // 26
  "        ", // 27
  "        ", // 28
  "Κυριάκος", // 29
  "Στρατόνικος, Στράτος", // 30

  // Οκτώβριος
  "Ανανίας, Θηρεσία", // 1
  "Κυπριανός", // 2
  "Διονύσιος", // 3 Αγίου Διονυσίου του Αρεοπαγίτου
  "Ιερόθεος", // 4
  "        ", // 5
  "Θωμάς", // 6
  "Πολυχρόνης, Σέργιος, Βάκχος", // 7
  "Πελαγία", // 8
  "Αβραάμ", // 9
  "Ευλάμπιος", // 10
  "        ", // 11
  "        ", // 12
  "Χρυσή", // 13
  "Ιγνάτιος", // 14
  "Λουκιανός", // 15
  "Λογγίνος", // 16
  "        ", // 17
  "Λουκάς", // 18
  "        ", // 19
  "Αρτέμιος, Άρτεμις", // 20
  "        ", // 21
  "        ", // 22
  "Ιάκωβος, Ιακωβίνα", // 23
  "Σεβαστή", // 24
  "Χρυσάφης, Χρυσάνθη", // 25
  "Δημήτριος,  Δημήτρης, Δήμητρα", // 26
  "Νέστορας, Νέστωρ, Νεστορία", // 27
  " Νεφέλη", // 28
  "Αβραάμ", // 29
  " Ζηνοβία", // 30
  " Νάρκισος, Στρατονίκη", // 31

  // Νοέμβριος
  "Κοσμάς, Δαμιανός, Δαμιανή, Ανάργυρος, Αναργυρούλα", // 1
  "Ακίνδυνος, Ελπιδηφόρος", // 2
  "        ", // 3
  "        ", // 4
  "Γαλατεία, Σιλβανός, Σιλβάνα, Επιστήμη", // 5
  "Λεονάρδος", // 6
  "Ερνέστος, Αθηνόδωρος, Αθηνοδώρα", // 7
  "Μιχαήλ, Γαβριήλ, Ραφαήλ", // 8
  "Νεκτάριος, Νεκταρία", // 9
  "Αρσένιος, Αρσένης, Αρσενία", // 10
  "Μηνάς, Βικτωρία", // 11
  "Νείλος", // 12
  "Δαμασκηνός, Δαμασκηνή, Χρυσόστομος, Χρυσοστόμης, Χρυσοστόμη, Χρυσοστομία", // 13
  "Γρηγόριος, Γρηγόρης, Γρηγορία, Φίλιππος, Φίλιππας, Φιλίτσα", // 14 Γρηγορίου του Παλαμά αρχιεπισκόπου Θεσσαλονίκης, Φιλίππου του Αποστόλου
  "        ", // 15
  "Ματθαίος, Ιφιγένεια", // 16
  "Γεννάδιος", // 17
  "Πλάτων", // 18
  "         ", // 19
  "         ", // 20
  "Μαρία, Μάριος, Δέσποινα, Πανωραία, Σουλτάνα, Βιργινία", // 21 Εισόδια της Θεοτόκου
  "Βαλέρια, Βαλέριος", // 22
  "Αμφιλόχιος", // 23
  "        ", // 24
  "Αικατερίνη, Κατερίνα", // 25
  "Στυλιανός, Στυλιανή, Στέλλα", // 26
  "        ", // 27
  "        ", // 28
  "Φαίδρα", // 29
  "Ανδρέας, Αντρέας, Ανδρίκος, Αντρίκος, Ανδριάνα, Ανδρούλα, Ανδριανή", // 30

  // Δεκέμβριος
  "Θεόκλητος, Θεοκλήτη, Φιλαρέτη, Φιλάρετος", // 1
  "Μερόπη", // 2
  "        ", // 3
  "Βαρβάρα, Σεραφείμ", // 4
  "Σάββας, Σαββούλα", // 5
  "Νικόλαος, Νικολέττα", // 6
  "Αμβρόσιος", // 7
  "        ", // 8
  "Άννα", // 9
  "Μηνάς", // 10
  "        ", // 11
  "Σπυρίδων, Σπύρος, Σπυριδούλα", // 12
  " Ευστράτιος", // 13
  "Δανάη, Ρεβέκκα        ", // 14
  "Ελευθέριος, Ελευθερία", // 15
  "        ", // 16
  "Διονύσιος, Διονύσης, Νιόνιος, Διονυσία, Δανιήλ", // 17
  "Σεβαστιανός, Φλώρα", // 18
  "        ", // 19
  "Ιγνάτιος, Ιγνάτης, Ιγνατία", // 20
  "Ιωσήφ, Ιουλιανή, Θεμιστοκλής", // 21
  "Αναστασία", // 22  Αναστασίας Φαρμακολύτριας, Αγίου Ζωίλου
  "        ", // 23
  "Ευγενία", // 24
  "Χριστίνα, Χριστός, ", // 25
  "Εμμανουήλ, Μανώλης, Μανόλης", // 26
  "Στέφανος, Στεφανία", // 27
  "Δόμνα, Θεόφιλος", // 28
  "        ", // 29
  "        ", // 30
  "        " // 31
};

#endif // NAMEDAYS_GR_H
// clang-format on
